БухЭксп/Reports/CW_АнализГрузоперевозокПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_АнализГрузоперевозокПоБюджетам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_АктированиеИсходящихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_АктированиеИсходящихСчетов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_АктированиеВходящихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_АктированиеВходящихСчетов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_РасходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_РасходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОтсутствующиеОригиналыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОтсутствующиеОригиналыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_АнализГрузоперевозокПоБюджетам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура Инициализация()
	
	ВыводитьРезультатВВалютеДокументов = _БЭ.ПолучитьНастройкуПользователя(_БЭ.Пользователь(), "ВыводитьФинансовыйРезультатВВалютеДокументов");
	ВРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	НовСтрока = СоответствиеЭлементов.Добавить();
	НовСтрока.ЭлементИтогов 	= "БюджетРасходыПланИтого";
	НовСтрока.ЭлементТаблица	= "БюджетРасходыПлан";
	НовСтрока.ВидЭлемента 		= 0; // расходы
	
	НовСтрока = СоответствиеЭлементов.Добавить();
	НовСтрока.ЭлементИтогов 	= "БюджетДоходыПланИтого";
	НовСтрока.ЭлементТаблица	= "БюджетДоходыПлан";
	НовСтрока.ВидЭлемента 		= 1; // доходы
	
	НовСтрока = СоответствиеЭлементов.Добавить();
	НовСтрока.ЭлементИтогов 	= "БюджетРасходыФактИтого";
	НовСтрока.ЭлементТаблица	= "БюджетРасходыФакт";
	НовСтрока.ВидЭлемента 		= 0; // расходы
	
	НовСтрока = СоответствиеЭлементов.Добавить();
	НовСтрока.ЭлементИтогов 	= "БюджетДоходыФактИтого";
	НовСтрока.ЭлементТаблица	= "БюджетДоходыФакт";
	НовСтрока.ВидЭлемента 		= 1; // доходы
	
	//Для каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
	//	
	//	Если Не ТипЗнч(ЭлементНастройки) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	СписокПоказателей.Добавить(ЭлементНастройки.Заголовок,ЭлементНастройки.Заголовок,Истина);
	//	
	//КонецЦикла;	

КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инициализация();
	// если переданы параметры - выполняем отчёт
	Если Параметры.Свойство("Грузоперевозки") Тогда
		
		Грузоперевозки 		= Параметры.Грузоперевозки;
		ВерсияБюджетаПлан 	= _сф.ст_ПолучитьСвойство(Параметры,"ВерсияБюджетаПлан",Константы.CW_БазоваяВерсияБюджета.Получить());
		ВерсияБюджетаФакт 	= _сф.ст_ПолучитьСвойство(Параметры,"ВерсияБюджетаФакт",Справочники.CW_ВерсииБюджетов.Основная);
		Валюта				= Константы.ВалютаРегламентированногоУчета.Получить();
		
		Если Грузоперевозки.Количество() Тогда
			Заказ			= Грузоперевозки[0].Значение.Заказ;
		КонецЕсли;	
			
		СформироватьПриОткрытии = Истина;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаРезультат;
		
	Иначе
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНастройкиОтчета;
				
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если СформироватьПриОткрытии Тогда
		СформироватьПриОткрытии = Ложь;
		НастроитьПоказателиОтчета();
		_Настройка(Истина);
		СформироватьОтчет();
	Иначе	
		_ВосстановитьСтандартныеНастройки();
		_ВосстановитьСеансовуюНастройку();
	КонецЕсли; 
	
	ЗаказДоИзм = Заказ;
	ОбновитьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_АнализГрузоперевозокПоБюджетам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	// --- 
	
	// пытаемся восстановить настройки
	Идентификатор 		= РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка	= ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	
	Если СеансоваяНастройка <> Неопределено Тогда
		
		Попытка
			
			Если Константы.CW_ИспользованиеБюджетирования.Получить() Тогда
				
				СеансоваяНастройка.Свойство("ВерсияБюджетаПлан",ВерсияБюджетаПлан);
				
				Если НЕ ЗначениеЗаполнено(ВерсияБюджетаПлан) Тогда
					ВерсияБюджетаПлан = Справочники.CW_ВерсииБюджетов.Основная();
				КонецЕсли;	
				
				СеансоваяНастройка.Свойство("ВерсияБюджетаФакт",ВерсияБюджетаФакт);
				
				Если НЕ ЗначениеЗаполнено(ВерсияБюджетаФакт) Тогда
					ВерсияБюджетаФакт = _ПолучитьБазовуюВерсиюБюджета();
				КонецЕсли;	
	
			КонецЕсли;	
			
			СеансоваяНастройка.Свойство("Организация"		,Организация);
			СеансоваяНастройка.Свойство("ФормированиеОтчета",ФормированиеОтчета);
			СеансоваяНастройка.Свойство("Валюта"			,Валюта);
			СеансоваяНастройка.Свойство("ПараметрЗакрытия",ПараметрЗакрытия);
			СеансоваяНастройка.Свойство("ПараметрКонтроля",ПараметрКонтроля);
			
			спПоказатели = Новый СписокЗначений;
			СеансоваяНастройка.Свойство("СписокПоказателей",спПоказатели);
			
			Если (СеансоваяНастройка.Свойство("НастройкиСКД")) Тогда
				
			КонецЕсли; 
			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СеансоваяНастройка.НастройкиСКД);
			
			//Если Не спПоказатели = Неопределено И спПоказатели.Количество() Тогда
			//	СеансоваяНастройка.Свойство("СписокПоказателей",СписокПоказателей);
			//КонецЕсли;	
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	// --- 
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("ВерсияБюджетаПлан",ВерсияБюджетаПлан);
	СтруктураНастройки.Вставить("ВерсияБюджетаФакт",ВерсияБюджетаФакт);
	// --- 
	СтруктураНастройки.Вставить("ПараметрЗакрытия",ПараметрЗакрытия);
	СтруктураНастройки.Вставить("ПараметрКонтроля",ПараметрКонтроля);
	// --- 
	СтруктураНастройки.Вставить("Организация"		,Организация);
	СтруктураНастройки.Вставить("ФормированиеОтчета",ФормированиеОтчета);
	СтруктураНастройки.Вставить("Валюта"			,Валюта);
	//СтруктураНастройки.Вставить("СписокПоказателей"	,СписокПоказателей);
	СтруктураНастройки.Вставить("НастройкиСКД", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 
&НаКлиенте
Процедура НастроитьПоказателиОтчета()
	
	//ВсегоПоказателей = СписокПоказателей.Количество() - 1;
	//
	//Для к = 0 По ВсегоПоказателей Цикл
	//	
	//	ТекИндексСписка = ВсегоПоказателей - к;
	//	ЭлементСписка 	= СписокПоказателей.Получить(ТекИндексСписка);
	//	
	//	Для каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
	//		
	//		Если Не ЭлементНастройки.Заголовок = ЭлементСписка.Значение Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		
	//		ЭлементНастройки.Использование = ЭлементСписка.Пометка;
	//		
	//		// порядок полей не изменен..
	//		//---------------------------
	//		Смещение = ТекИндексСписка - (Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Индекс(ЭлементНастройки) + 1);
	//		
	//		Если Смещение = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		
	//		Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Сдвинуть(ЭлементНастройки,Смещение);
	//		
	//		Прервать;
	//		
	//	КонецЦикла;	
	//	
	//КонецЦикла;	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура Сформировать(Команда)
	
	ВсеХорошо = Истина;
	
	Если Не ЗначениеЗаполнено(ВерсияБюджетаПлан) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнения версия бюджета (план)!";
		Сообщение.Сообщить(); 
		
		ВсеХорошо = Ложь;
	
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ВерсияБюджетаФакт) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнения версия бюджета (факт)!";
		Сообщение.Сообщить(); 
		
		ВсеХорошо = Ложь;
	
	КонецЕсли; 
	
	Если Не ВсеХорошо Тогда
		Возврат;
	КонецЕсли; 
	
	//НастроитьПоказателиОтчета();
	
	Если Не ЗначениеЗаполнено(Заказ) И Грузоперевозки.Количество() Тогда
		
		Заказ = Грузоперевозки[0].Значение.Заказ;
		
	КонецЕсли;	
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаРезультат;
	
	_Настройка(Истина);
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
	ОбработатьОтчет();	
	Номенклатура=Неопределено;
	_ОтборПоНоменклатуре(Неопределено);
	
	// --- 
	
	_ПолучитьОстаткиАктирования();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	// --- 
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();	
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	// --- 
	
	Настройки = _сф.ст_Создать("Грузоперевозки,ВерсияБюджетаПлан,ВерсияБюджетаФакт,Организация,ФормированиеОтчета,Валюта,СписокПоказателей,Заказ");
	Настройки.Грузоперевозки 	 = Грузоперевозки;
	Настройки.ВерсияБюджетаПлан  = ВерсияБюджетаПлан;
	Настройки.ВерсияБюджетаФакт  = ВерсияБюджетаФакт;
	Настройки.Организация 		 = Организация;
	Настройки.ФормированиеОтчета = ФормированиеОтчета;
	Настройки.Валюта 			 = Валюта;
	Настройки.СписокПоказателей	 = СписокПоказателей;
	Настройки.Заказ				 = Заказ;
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Функция ЗаменитьТекстВТаблицеРезультата(ТабДок, стрЧтоИщем, стрНаЧтоМеняем, НовоеГоризонтальноеПоложение = Неопределено, МаксНомерСтрокиПоиска = Неопределено, СловоЦеликом = Ложь) 
	
	ПредНайденнаяОбласть = Неопределено;
	
	Если ЗначениеЗаполнено(МаксНомерСтрокиПоиска) Тогда 
		ГдеИскать = ТабДок.Область(1,,МаксНомерСтрокиПоиска,);
	Иначе 
		ГдеИскать = Неопределено;
	КонецЕсли;
	
	Пока Истина Цикл
	
		НайденнаяОбласть = ТабДок.НайтиТекст(стрЧтоИщем, ПредНайденнаяОбласть, ГдеИскать); 
		Если Неопределено=НайденнаяОбласть Тогда 
			Прервать;
		Иначе 
			ПредНайденнаяОбласть = НайденнаяОбласть;
		КонецЕсли;
		
		// если кроме искомого слова ничего больше в данной области нет
		// тогда можно приступить к действиям по форматированию..
		//---------------------------------------------------------------
		Если СловоЦеликом и СтрЗаменить(НайденнаяОбласть.Текст, стрЧтоИщем, "") <> "" Тогда
			Продолжить;
		КонецЕсли;	
		
		Если стрЧтоИщем<>стрНаЧтоМеняем Тогда 
			
			НайденнаяОбласть.Текст = СтрЗаменить(НайденнаяОбласть.Текст, стрЧтоИщем, стрНаЧтоМеняем);
			
		КонецЕсли;
			
		Если НЕ Неопределено=НовоеГоризонтальноеПоложение Тогда 
			НайденнаяОбласть.ГоризонтальноеПоложение = НовоеГоризонтальноеПоложение;
		КонецЕсли;
		
	КонецЦикла;
	
	//НайденнаяОбласть.Шрифт =Новый Шрифт(НайденнаяОбласть.Шрифт, , 10);

КонецФункции


&НаСервере
Процедура ОбработатьОтчет()
	
	ЗаменитьТекстВТаблицеРезультата(Результат, "План"				, "План"				, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Факт"				, "Факт"				, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Бюджет Отклонение"	, "Бюджет Отклонение"	, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Финансы"			, "Финансы"				, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Финансы Отклонение"	, "Финансы Отклонение"	, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Доход"				, "Доход"				, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Расход"				, "Расход"				, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Дельта План"		, "Дельта План"			, ГоризонтальноеПоложение.Центр);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Дельта Факт"		, "Дельта Факт"			, ГоризонтальноеПоложение.Центр);
	
	ЗаменитьТекстВТаблицеРезультата(Результат, "Р" , "Р"	, ГоризонтальноеПоложение.Центр,,Истина);
	ЗаменитьТекстВТаблицеРезультата(Результат, "Д" , "Д"	, ГоризонтальноеПоложение.Центр,,Истина);
	ЗаменитьТекстВТаблицеРезультата(Результат, "П" , "П"	, ГоризонтальноеПоложение.Центр,,Истина);

	//Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	// --- 
	
	//Если Скрыть Тогда
	//	
	//	Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
	//	Элементы.ФормаНастройка.Пометка=Ложь;
	//	
	//Иначе
	//	
	//	Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
	//		
	//		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
	//		Элементы.ФормаНастройка.Пометка=Ложь;
	//		
	//	Иначе
	//		
	//		Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
	//		Элементы.ФормаНастройка.Пометка=Истина;
	//		
	//	КонецЕсли; 
	//	
	//КонецЕсли; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ПолучитьОстаткиАктирования()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_АктированиеИсходящихСчетовОстатки.Счет,
	               |	CW_АктированиеИсходящихСчетовОстатки.Грузоперевозка,
	               |	CW_АктированиеИсходящихСчетовОстатки.Номенклатура,
	               |	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток КАК Всего
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеИсходящихСчетов.Остатки(&Период, Грузоперевозка В (&Грузоперевозки)) КАК CW_АктированиеИсходящихСчетовОстатки";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки.ВыгрузитьЗначения()); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	СуммаНеактированныхИсходящих = ТЗ.Итог("Всего");
	
	Если (СуммаНеактированныхИсходящих = 0) Тогда
		
		НеактированоИсходящих = "Все исходящие счета заактированы";
		
	Иначе
		
		НеактированоИсходящих = "Имеются незаактированные исходящие счета";
		
	КонецЕсли; 
	
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_АктированиеВходящихСчетовОстатки.Счет,
	               |	CW_АктированиеВходящихСчетовОстатки.Грузоперевозка,
	               |	CW_АктированиеВходящихСчетовОстатки.Номенклатура,
	               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК Всего
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(&Период, Грузоперевозка В (&Грузоперевозки)) КАК CW_АктированиеВходящихСчетовОстатки";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки.ВыгрузитьЗначения()); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	СуммаНеактированныхВходящих = ТЗ.Итог("Всего");
	
	Если (СуммаНеактированныхВходящих = 0) Тогда
		
		НеактированоВходящих = "Все входящие счета заактированы";
		
	Иначе
		
		НеактированоВходящих = "Имеются незаактированные входящие счета";
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	Ответ = _РежимРасшифровки(Расшифровка);
    СтандартнаяОбработка = Ложь;
	Возврат; // тмп	
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
    
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаСервере
Функция _РежимРасшифровки(Расшифровка)
	// --- 
	
	ДР = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ЭлементРасшифровки = ДР.Элементы.Получить(Расшифровка);
	
	Поля = ЭлементРасшифровки.ПолучитьПоля();
	Если (Поля.Количество() <> 0) Тогда
		
		ИмяПоля = Поля[0].Поле;
		//Сообщить(ИмяПоля);
		Номенклатура = Неопределено;
		// --- 
		Номенклатура = ДР.Элементы.Получить(ЭлементРасшифровки.ПолучитьРодителей()[0].Идентификатор).ПолучитьПоля()[0].Значение;
		
		Если (ИмяПоля = "ПланРасход") Тогда
			
			Элементы.ГруппаСтраницыБюджета.ТекущаяСтраница = Элементы.ГруппаПлан;
			Элементы.ГруппаДоходыРасходыПлан.ТекущаяСтраница = Элементы.ГруппаРасходыПлан;
			
		ИначеЕсли (ИмяПоля = "ПланДоход") Тогда 
			
			Элементы.ГруппаСтраницыБюджета.ТекущаяСтраница = Элементы.ГруппаПлан;
			Элементы.ГруппаДоходыРасходыПлан.ТекущаяСтраница = Элементы.ГруппаДоходыПлан; 
			
		ИначеЕсли (ИмяПоля = "ФактРасход") Тогда 
			
			Элементы.ГруппаСтраницыБюджета.ТекущаяСтраница = Элементы.ГруппаФакт;
			Элементы.ГруппаДоходыРасходыФакт.ТекущаяСтраница = Элементы.ГруппаРасходыФакт;
			
		ИначеЕсли (ИмяПоля = "ФактДоход") Тогда 
			
			Элементы.ГруппаСтраницыБюджета.ТекущаяСтраница = Элементы.ГруппаФакт;
			Элементы.ГруппаДоходыРасходыФакт.ТекущаяСтраница = Элементы.ГруппаДоходыФакт;
			
		ИначеЕсли (ИмяПоля = "ФинансыРасход") Тогда 
			
			Элементы.ГруппаСтраницыБюджета.ТекущаяСтраница = Элементы.ГруппаФинансы;
			Элементы.ГруппаДоходыРасходыФинансы.ТекущаяСтраница = Элементы.ГруппаФинансыРасходы;
			
		ИначеЕсли (ИмяПоля = "ФинансыДоход") Тогда 
			
			Элементы.ГруппаСтраницыБюджета.ТекущаяСтраница = Элементы.ГруппаФинансы;
			Элементы.ГруппаДоходыРасходыФинансы.ТекущаяСтраница = Элементы.ГруппаФинансыДоходы;
			
		КонецЕсли; 
		
	Иначе
		
		//_ОтборПоНоменклатуре(Неопределено);
		
	КонецЕсли; 
	
	
	Если (Номенклатура <> Неопределено) Тогда
		
		_ОтборПоНоменклатуре(Номенклатура);
		
	КонецЕсли; 
	
	// ЭлементРасшифровки.ПолучитьПоля()[0].Поле // ФинансыДоход
	//ДР.Элементы.Получить(ЭлементРасшифровки.ПолучитьРодителей()[0]).Значение // Номенклатура
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Процедура _ОтборПоНоменклатуре(Номенклатура)
	// --- 
	
	Если (Номенклатура = Неопределено) Тогда
		Отбор = Неопределено;
	Иначе
		Отбор = Новый ФиксированнаяСтруктура(Новый Структура("Номенклатура",Номенклатура));	
	КонецЕсли; 
	// --- 
	Элементы.БюджетРасходыПлан.ОтборСтрок = Отбор;
	Элементы.БюджетДоходыПлан.ОтборСтрок = Отбор;
	Элементы.БюджетРасходыФакт.ОтборСтрок = Отбор;
	Элементы.БюджетДоходыФакт.ОтборСтрок = Отбор;
	БюджетОбновитьИтоги(Истина,Истина);	
	// --- 
	Элементы.ФинансыРасходы.ОтборСтрок = Отбор;
	Элементы.ФинансыДоходы.ОтборСтрок = Отбор;
	ФинансыОбновитьИтоги();
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных=РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораЗаказа(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		Грузоперевозки = ПолучитьИзВременногоХранилища(Ответ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГрузоперевозки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГрузоперевозки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		Грузоперевозки.Добавить(Ответ);
	КонецЕсли;
	
	ОбновитьТаблицы();
	
	// --- 
КонецПроцедуры
  
&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("ВерсияБюджетаПлан"	, ВерсияБюджетаПлан);
	Настройки.ДополнительныеСвойства.Вставить("ВерсияБюджетаФакт"	, ВерсияБюджетаФакт);
	Настройки.ДополнительныеСвойства.Вставить("Организация"			, Организация);
	Настройки.ДополнительныеСвойства.Вставить("ФормированиеОтчета"	, ФормированиеОтчета);
	Настройки.ДополнительныеСвойства.Вставить("Валюта"				, Валюта);
	Настройки.ДополнительныеСвойства.Вставить("СписокПоказателей"	, СписокПоказателей);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма,Настройки);
		
		Если НЕ ЗначениеЗаполнено(ВерсияБюджетаПлан) Тогда
			ВерсияБюджетаПлан = Справочники.CW_ВерсииБюджетов.Основная;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ВерсияБюджетаФакт) Тогда
			ВерсияБюджетаФакт = _ПолучитьБазовуюВерсиюБюджета();
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПометкаПриИзменении(Элемент)
	
	ПроверитьБюджет();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьБюджет()
	
КонецПроцедуры	

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджетаПлан) Тогда
		ВерсияБюджетаПлан = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьБазовуюВерсиюБюджета()
	
	Возврат ?(ЗначениеЗаполнено(Константы.CW_БазоваяВерсияБюджета.Получить()), Константы.CW_БазоваяВерсияБюджета.Получить(), Справочники.CW_ВерсииБюджетов.Основная);
	
КонецФункции

&НаКлиенте
Процедура ВерсияБюджетаФактПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджетаФакт) Тогда
		ВерсияБюджетаФакт = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры


// работа с бюджетами..
//---------------------
&НаСервере
Функция ФинансыРасходыОбновить()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
	               |	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкам.Договор КАК Договор,
	               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов КАК Документ,
	               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	CW_РасходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
	               |	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
	               |	НЕ CW_РасходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
	               |	CW_РасходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
	               |	CW_РасходыПоГрузоперевозкам.Всего КАК Всего,
	               |	CW_РасходыПоГрузоперевозкам.Сумма КАК Сумма,
	               |	CW_РасходыПоГрузоперевозкам.НДС КАК НДС,
	               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Дата КАК Дата,
	               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Организация КАК Организация,
	               |	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
	               |		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_ОтсутствующиеОригиналыДокументов.Документ
	               |			И CW_РасходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
	               |			И CW_РасходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка В(&мГрузоперевозок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Грузоперевозка,
	               |	ВТ.Контрагент,
	               |	ВТ.Договор,
	               |	ВТ.Документ,
	               |	ВТ.ПредставлениеДокумента,
	               |	ВТ.Номенклатура,
	               |	ВТ.Валюта,
	               |	ВТ.ЭтоСчет,
	               |	ВТ.ВсегоВал,
	               |	ВТ.Всего,
	               |	ВТ.Сумма,
	               |	ВТ.НДС,
	               |	ВТ.Дата,
	               |	ВТ.Организация,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ОригиналыПредоставлены,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК НомерКонтейнера
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ.Контрагент,
	               |	ВТ.Договор,
	               |	ВТ.Документ,
	               |	ВТ.Номенклатура,
	               |	ВТ.Валюта,
	               |	ВТ.Грузоперевозка,
	               |	ВТ.ЭтоСчет";
		
	Запрос.УстановитьПараметр("мГрузоперевозок", Грузоперевозки.ВыгрузитьЗначения());
	
	тЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТЗ = тЗапроса.Скопировать();

	ТЗ.Свернуть("Контрагент,Номенклатура,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,НомерКонтейнера", "ВсегоВал,Всего,Сумма,НДС");
	ТЗ.Сортировать("Дата Возр");
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		
		мСтрок = тЗапроса.НайтиСтроки(Новый Структура("Документ",СтрокаТЗ.Документ));
		
		Для каждого СтрокаМассива из мСтрок Цикл
			
			Если Найти(СтрокаТЗ.НомерКонтейнера, СтрокаМассива.Грузоперевозка) <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЗ.НомерКонтейнера = СтрокаТЗ.НомерКонтейнера + СокрЛП(СтрокаМассива.Грузоперевозка) + ", ";
		КонецЦикла;
		
		Если Прав(СокрЛП(СтрокаТЗ.НомерКонтейнера),1) = "," Тогда
			СтрокаТЗ.НомерКонтейнера = Лев(СтрокаТЗ.НомерКонтейнера,СтрДлина(СтрокаТЗ.НомерКонтейнера) - 2);
		КонецЕсли;
		
	КонецЦикла;	
			
	ФинансыРасходы.Загрузить(ТЗ);

	ТЗД = ТЗ.Скопировать(, "Документ");                              
	ТЗД.Свернуть("Документ");
	
	КоличествоЗатратных = ТЗД.Количество();
	
	Элементы.ГруппаФинансыРасходы.Заголовок = "Расходы" + ?(КоличествоЗатратных = 0, "", " (" + Строка(КоличествоЗатратных) + ")");

КонецФункции

&НаСервере
Функция ФинансыДоходыОбновить()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ДоходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ДоходыПоГрузоперевозкам.Контрагент КАК Контрагент,
	               |	CW_ДоходыПоГрузоперевозкам.Договор КАК Договор,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК Документ,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	CW_ДоходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
	               |	CW_ДоходыПоГрузоперевозкам.Валюта КАК Валюта,
	               |	НЕ CW_ДоходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
	               |	CW_ДоходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
	               |	CW_ДоходыПоГрузоперевозкам.Всего КАК Всего,
	               |	CW_ДоходыПоГрузоперевозкам.Сумма КАК Сумма,
	               |	CW_ДоходыПоГрузоперевозкам.НДС КАК НДС,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Дата КАК Дата,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация КАК Организация,
	               |	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
	               |		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_ОтсутствующиеОригиналыДокументов.Документ
	               |			И CW_ДоходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
	               |			И CW_ДоходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&мГрузоперевозок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Грузоперевозка,
	               |	ВТ.Контрагент,
	               |	ВТ.Договор,
	               |	ВТ.Документ,
	               |	ВТ.ПредставлениеДокумента,
	               |	ВТ.Номенклатура,
	               |	ВТ.Валюта,
	               |	ВТ.ЭтоСчет,
	               |	ВТ.ВсегоВал,
	               |	ВТ.Всего,
	               |	ВТ.Сумма,
	               |	ВТ.НДС,
	               |	ВТ.Дата,
	               |	ВТ.Организация,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ОригиналыПредоставлены,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК НомерКонтейнера
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ.Контрагент,
	               |	ВТ.Договор,
	               |	ВТ.Документ,
	               |	ВТ.Номенклатура,
	               |	ВТ.Валюта,
	               |	ВТ.Грузоперевозка,
	               |	ВТ.ЭтоСчет";
	
	Запрос.УстановитьПараметр("мГрузоперевозок", Грузоперевозки.ВыгрузитьЗначения());
	
	тЗапроса = Запрос.Выполнить().Выгрузить();
	ТЗ = тЗапроса.Скопировать();
	
	ТЗ.Свернуть("Контрагент,Номенклатура,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,НомерКонтейнера", "ВсегоВал,Всего,Сумма,НДС");
	ТЗ.Сортировать("Дата Возр");
	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		
		мСтрок = тЗапроса.НайтиСтроки(Новый Структура("Документ",СтрокаТЗ.Документ));
		
		Для каждого СтрокаМассива из мСтрок Цикл
			
			Если Найти(СтрокаТЗ.НомерКонтейнера, СтрокаМассива.Грузоперевозка) <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЗ.НомерКонтейнера = СтрокаТЗ.НомерКонтейнера + СокрЛП(СтрокаМассива.Грузоперевозка) + ", ";
		КонецЦикла;
		
		Если Прав(СокрЛП(СтрокаТЗ.НомерКонтейнера),1) = "," Тогда
			СтрокаТЗ.НомерКонтейнера = Лев(СтрокаТЗ.НомерКонтейнера,СтрДлина(СтрокаТЗ.НомерКонтейнера) - 2);
		КонецЕсли;
		
	КонецЦикла;	
	
	ТЗ.Свернуть("Контрагент,Номенклатура,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента", "ВсегоВал,Всего,Сумма,НДС");
	ТЗ.Сортировать("Дата Возр");
	
	ФинансыДоходы.Загрузить(ТЗ);
	
	ТЗД = ТЗ.Скопировать(, "Документ");
	ТЗД.Свернуть("Документ");
	КоличествоДоходных = ТЗД.Количество();
	
	Элементы.ГруппаФинансыДоходы.Заголовок = "Доходы" + ?(КоличествоДоходных = 0, "", " (" + Строка(КоличествоДоходных) + ")");

КонецФункции

&НаСервере
Процедура ОбновитьТаблицыФинансов(ИмяТаблицы = Неопределено)
	
	Если ИмяТаблицы = Неопределено Или ИмяТаблицы = "ФинансыРасходы" Тогда
		ФинансыРасходыОбновить();
	КонецЕсли;
	
	Если ИмяТаблицы = Неопределено Или ИмяТаблицы = "ФинансыДоходы" Тогда
		ФинансыДоходыОбновить();
	КонецЕсли;
	
	ФинансыОбновитьИтоги();
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьТаблицыБюджета_ПоГрузоперевозкам(ВерсияБюджета, флЗатраты, флДоходы) Экспорт 
	
		з = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК СтатьяСсылка,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Валюта,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Курс,
		|	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Сумма,
		|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДС,
		|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсего,
		|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаРуб,
		|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДСРуб,
		|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсегоРуб,
		|	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Организация
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		|ГДЕ
		|	CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&мГрузоперевозок)
		|	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.СтатьяСсылка,
		|	вт.Контрагент,
		|	вт.Номенклатура,
		|	вт.Валюта,
		|	вт.Курс,
		|	вт.СтавкаНДС,
		|	СУММА(вт.Сумма) КАК Сумма,
		|	СУММА(вт.СуммаНДС) КАК СуммаНДС,
		|	СУММА(вт.СуммаВсего) КАК СуммаВсего,
		|	СУММА(вт.СуммаРуб) КАК СуммаРуб,
		|	СУММА(вт.СуммаНДСРуб) КАК СуммаНДСРуб,
		|	СУММА(вт.СуммаВсегоРуб) КАК СуммаВсегоРуб,
		|	вт.Организация
		|ИЗ
		|	вт КАК вт
		|ГДЕ
		|	&флЗатраты
		|	И вт.ВидСтатьиПланирования = ЗНАЧЕНИЕ(Перечисление.CW_ВидыСтатейПланирования.Расходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Контрагент,
		|	вт.Валюта,
		|	вт.СтавкаНДС,
		|	вт.СтатьяСсылка,
		|	вт.Организация,
		|	вт.Номенклатура,
		|	вт.Курс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.СтатьяСсылка,
		|	вт.Контрагент,
		|	вт.Номенклатура,
		|	вт.Валюта,
		|	вт.Курс,
		|	вт.СтавкаНДС,
		|	СУММА(вт.Сумма) КАК Сумма,
		|	СУММА(вт.СуммаНДС) КАК СуммаНДС,
		|	СУММА(вт.СуммаВсего) КАК СуммаВсего,
		|	СУММА(вт.СуммаРуб) КАК СуммаРуб,
		|	СУММА(вт.СуммаНДСРуб) КАК СуммаНДСРуб,
		|	СУММА(вт.СуммаВсегоРуб) КАК СуммаВсегоРуб,
		|	вт.Организация
		|ИЗ
		|	вт КАК вт
		|ГДЕ
		|	&флДоходы
		|	И вт.ВидСтатьиПланирования = ЗНАЧЕНИЕ(Перечисление.CW_ВидыСтатейПланирования.Доходы)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Валюта,
		|	вт.СтатьяСсылка,
		|	вт.Контрагент,
		|	вт.СтавкаНДС,
		|	вт.Номенклатура,
		|	вт.Организация,
		|	вт.Курс"
	);
	з.УстановитьПараметр("мГрузоперевозок", Грузоперевозки.ВыгрузитьЗначения());
	з.УстановитьПараметр("ВерсияБюджета", ВерсияБюджета);
	з.УстановитьПараметр("флЗатраты", флЗатраты);
	з.УстановитьПараметр("флДоходы",  флДоходы);
	масс = з.ВыполнитьПакет();

	стру = Новый Структура(
		"тзЗатраты, тзДоходы", 
		масс[1].Выгрузить(), 
		масс[2].Выгрузить()
	);

	Возврат стру;
	
КонецФункции

&НаСервере
Функция ТаблицыБюджетаОбновить(ИмяТаблицы = Неопределено)
	
	НужныДоходыПлан 	= (ИмяТаблицы = Неопределено Или ИмяТаблицы = "ДоходыПлан");
	НужныРасходыПлан 	= (ИмяТаблицы = Неопределено Или ИмяТаблицы = "РасходыПлан");
	
	ОтветПлан = ПолучитьТаблицыБюджета_ПоГрузоперевозкам(ВерсияБюджетаПлан, НужныРасходыПлан, НужныДоходыПлан );
	
	Если НужныДоходыПлан Тогда
		БюджетДоходыПлан.Загрузить(ОтветПлан.тзДоходы);	
	КонецЕсли;
	
	Если НужныРасходыПлан Тогда
		БюджетРасходыПлан.Загрузить(ОтветПлан.тзЗатраты);	
	КонецЕсли;
	
	НужныДоходыФакт 	= (ИмяТаблицы = Неопределено Или ИмяТаблицы = "ДоходыФакт");
	НужныРасходыФакт 	= (ИмяТаблицы = Неопределено Или ИмяТаблицы = "РасходыФакт");
	
	ОтветФакт = ПолучитьТаблицыБюджета_ПоГрузоперевозкам(ВерсияБюджетаФакт, НужныРасходыФакт, НужныДоходыФакт);
	
	Если НужныРасходыФакт Тогда
		БюджетРасходыФакт.Загрузить(ОтветФакт.тзЗатраты);	
	КонецЕсли;
	
	Если НужныДоходыФакт Тогда
		БюджетДоходыФакт.Загрузить(ОтветФакт.тзДоходы);
	КонецЕсли;	
	
	БюджетОбновитьИтоги();
	
КонецФункции

Функция БюджетОбновитьИтоги(флОбновлятьЗатраты = Истина, флОбновлятьДоходы = Истина)
	
	ФорматВывода = "ЧЦ=15; ЧДЦ=2; ЧН=";

	ВыводитьРезультатВБазовойВалюте = Истина;
	ВыводитьРасходыВБазовойВалюте = Истина;
	ВыводитьДоходыВБазовойВалюте = Истина;

	Если ВыводитьРезультатВВалютеДокументов Тогда

		ОбщаяВалюта 	= ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
		ВалютыРасходов 	= БюджетРасходыПлан.Выгрузить(, "Валюта");
		
		Для каждого СтрокаТЗ из БюджетРасходыФакт Цикл
			
			НовСтрока = ВалютыРасходов.Добавить();
			НовСтрока.Валюта = СтрокаТЗ.Валюта;
			
		КонецЦикла;	
			
		ВалютыРасходов.Свернуть("Валюта");
	
			
		ВалютыДоходов = БюджетДоходыПлан.Выгрузить(, "Валюта");
		
		Для каждого СтрокаТЗ из БюджетДоходыФакт Цикл
			
			НовСтрока = ВалютыДоходов.Добавить();
			НовСтрока.Валюта = СтрокаТЗ.Валюта;
			
		КонецЦикла;	
		
		ВалютыДоходов.Свернуть("Валюта");

		Если ВалютыРасходов.Количество() = 1 Тогда
			ВалютаРасходов = ВалютыРасходов[0].Валюта;
			ВыводитьРасходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаРасходов = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
		КонецЕсли;

		Если ВалютыДоходов.Количество() = 1 Тогда
			ВалютаДоходов = ВалютыДоходов[0].Валюта;
			ВыводитьДоходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаДоходов = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
		КонецЕсли;

	КонецЕсли;
	
	Если (ЗначениеЗаполнено(Номенклатура)) Тогда
		тзБюджетРасходыПлан = БюджетРасходыПлан.Выгрузить(Новый Структура("Номенклатура",Номенклатура));
		тзБюджетРасходыФакт = БюджетРасходыФакт.Выгрузить(Новый Структура("Номенклатура",Номенклатура));
		тзБюджетДоходыПлан = БюджетДоходыПлан.Выгрузить(Новый Структура("Номенклатура",Номенклатура));
		тзБюджетДоходыФакт = БюджетДоходыФакт.Выгрузить(Новый Структура("Номенклатура",Номенклатура));
	Иначе
		тзБюджетРасходыПлан = БюджетРасходыПлан.Выгрузить();
		тзБюджетРасходыФакт = БюджетРасходыФакт.Выгрузить();
		тзБюджетДоходыПлан = БюджетДоходыПлан.Выгрузить();
		тзБюджетДоходыФакт = БюджетДоходыФакт.Выгрузить();
	КонецЕсли; 

	Если флОбновлятьЗатраты Тогда
		
		мСтрок = СоответствиеЭлементов.НайтиСтроки(Новый Структура("ВидЭлемента",0));
		
		Для каждого Соответствие из мСтрок Цикл
			
			Если (ЗначениеЗаполнено(Номенклатура)) Тогда
				ТаблицаБюджета = ЭтаФорма[Соответствие.ЭлементТаблица].Выгрузить(Новый Структура("Номенклатура",Номенклатура));
			Иначе
				ТаблицаБюджета = ЭтаФорма[Соответствие.ЭлементТаблица].Выгрузить();
			КонецЕсли; 
			
			Если ВыводитьРасходыВБазовойВалюте Тогда
				
				Элементы[Соответствие.ЭлементИтогов].Заголовок = "Расходы: " + Формат(ТаблицаБюджета.Итог("СуммаВсегоРуб"), ФорматВывода) + " " + Строка(ВРУ) 
																	+ ", расходы без НДС: " + Формат(ТаблицаБюджета.Итог("СуммаРуб"), ФорматВывода) + " " + Строка(ВРУ);
				Если (ЗначениеЗаполнено(Номенклатура)) Тогда
					_сф.стр_Добавить(Элементы[Соответствие.ЭлементИтогов].Заголовок, "; Номенклатура="+Строка(Номенклатура));
				КонецЕсли;													
			
			Иначе
				
				
				Элементы[Соответствие.ЭлементИтогов].Заголовок = "Расходы: " + Формат(ТаблицаБюджета.Итог("СуммаВсего"), ФорматВывода) + " " + Строка(ВалютаРасходов);
				Если (ЗначениеЗаполнено(Номенклатура)) Тогда
					_сф.стр_Добавить(Элементы[Соответствие.ЭлементИтогов].Заголовок, "; Номенклатура="+Строка(Номенклатура));
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		// --- 
		Элементы.ГруппаРасходыПлан.Заголовок = "Расходы (" + тзБюджетРасходыПлан.Количество() + ")";
		Элементы.ГруппаРасходыФакт.Заголовок = "Расходы (" + тзБюджетРасходыФакт.Количество() + ")";

	КонецЕсли;

	Если флОбновлятьДоходы Тогда

		мСтрок = СоответствиеЭлементов.НайтиСтроки(Новый Структура("ВидЭлемента",1));
		
		Для каждого Соответствие из мСтрок Цикл
			
			Если (ЗначениеЗаполнено(Номенклатура)) Тогда
				ТаблицаБюджета = ЭтаФорма[Соответствие.ЭлементТаблица].Выгрузить(Новый Структура("Номенклатура",Номенклатура));
			Иначе
				ТаблицаБюджета = ЭтаФорма[Соответствие.ЭлементТаблица].Выгрузить();
			КонецЕсли;
			
			Если ВыводитьДоходыВБазовойВалюте Тогда
				
				Элементы[Соответствие.ЭлементИтогов].Заголовок = "Доходы: " + Формат(ТаблицаБюджета.Итог("СуммаВсегоРуб"), ФорматВывода) + " " + Строка(ВРУ) + ", Доходы без НДС: " + Формат(ЭтаФорма[Соответствие.ЭлементТаблица].Итог("СуммаРуб"), ФорматВывода) + " " + Строка(ВРУ);
				Если (ЗначениеЗаполнено(Номенклатура)) Тогда
					_сф.стр_Добавить(Элементы[Соответствие.ЭлементИтогов].Заголовок, "; Номенклатура="+Строка(Номенклатура));
				КонецЕсли; 
				
			Иначе
				
				Элементы[Соответствие.ЭлементИтогов].Заголовок = "Доходы: " + Формат(ТаблицаБюджета.Итог("СуммаВсего"), ФорматВывода) + " " + Строка(ВалютаДоходов);
				Если (ЗначениеЗаполнено(Номенклатура)) Тогда
					_сф.стр_Добавить(Элементы[Соответствие.ЭлементИтогов].Заголовок, "; Номенклатура="+Строка(Номенклатура));
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Элементы.ГруппаДоходыПлан.Заголовок = "Доходы (" + тзБюджетДоходыПлан.Количество() + ")";
		Элементы.ГруппаДоходыФакт.Заголовок = "Доходы (" + тзБюджетДоходыФакт.Количество() + ")";
		
	КонецЕсли;
	
	Если ВыводитьРезультатВБазовойВалюте Тогда
		
		Элементы.БюджетПланФинансовыйРезультатИтого.Заголовок = "Прибыль: " + Формат(тзБюджетДоходыПлан.Итог("СуммаВсегоРуб") - тзБюджетРасходыПлан.Итог("СуммаВсегоРуб"), ФорматВывода) + " " + Строка(ВРУ) + ", прибыль без НДС: " + Формат(БюджетДоходыПлан.Итог("СуммаРуб") - БюджетРасходыПлан.Итог("СуммаРуб"), ФорматВывода) + " " + Строка(ВРУ);
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(Элементы.БюджетПланФинансовыйРезультатИтого.Заголовок, "; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;
		Элементы.БюджетФактФинансовыйРезультатИтого.Заголовок = "Прибыль: " + Формат(тзБюджетДоходыФакт.Итог("СуммаВсегоРуб") - тзБюджетРасходыФакт.Итог("СуммаВсегоРуб"), ФорматВывода) + " " + Строка(ВРУ) + ", прибыль без НДС: " + Формат(БюджетДоходыФакт.Итог("СуммаРуб") - БюджетРасходыФакт.Итог("СуммаРуб"), ФорматВывода) + " " + Строка(ВРУ);
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(Элементы.БюджетФактФинансовыйРезультатИтого.Заголовок, "; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;
		
	Иначе


		Элементы.БюджетПланФинансовыйРезультатИтого.Заголовок = "Прибыль: " + Формат(тзБюджетДоходыПлан.Итог("СуммаВсего") - тзБюджетРасходыПлан.Итог("СуммаВсего"), ФорматВывода) + " " + Строка(ОбщаяВалюта);
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(Элементы.БюджетПланФинансовыйРезультатИтого.Заголовок, "; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;
		Элементы.БюджетФактФинансовыйРезультатИтого.Заголовок = "Прибыль: " + Формат(тзБюджетДоходыФакт.Итог("СуммаВсего") - тзБюджетРасходыФакт.Итог("СуммаВсего"), ФорматВывода) + " " + Строка(ОбщаяВалюта);
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(Элементы.БюджетФактФинансовыйРезультатИтого.Заголовок, "; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;
		
	КонецЕсли;
	

КонецФункции

Функция ПолучитьФинРез(ГП,ОтображениеФинРеза=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(CW_ДоходыПоГрузоперевозкам.Всего, 0) КАК ДоходыВсего,
		|	ЕСТЬNULL(CW_ДоходыПоГрузоперевозкам.Сумма, 0) КАК ДоходыСумма,
		|	0 КАК РасходыВсего,
		|	0 КАК РасходыСумма,
		|	ЕСТЬNULL(CW_ДоходыПоГрузоперевозкам.Всего_Валюта, 0) КАК ДоходыВсегоВалюта,
		|	0 КАК РасходыВсегоВалюта,
		|	CW_ДоходыПоГрузоперевозкам.Контрагент,
		|	CW_ДоходыПоГрузоперевозкам.Номенклатура
		|ПОМЕСТИТЬ Рез
		|ИЗ
		|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&СпГП)
		|	И ВЫБОР
		|			КОГДА &ФормированиеОтчета = 0
		|				ТОГДА CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт
		|			ИНАЧЕ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчет
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	ЕСТЬNULL(CW_РасходыПоГрузоперевозкам.Всего, 0),
		|	ЕСТЬNULL(CW_РасходыПоГрузоперевозкам.Сумма, 0),
		|	0,
		|	ЕСТЬNULL(CW_РасходыПоГрузоперевозкам.Всего_Валюта, 0),
		|	CW_РасходыПоГрузоперевозкам.Контрагент,
		|	CW_РасходыПоГрузоперевозкам.Номенклатура
		|ИЗ
		|	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
		|ГДЕ
		|	CW_РасходыПоГрузоперевозкам.Грузоперевозка В(&СпГП)
		|	И ВЫБОР
		|			КОГДА &ФормированиеОтчета = 0
		|				ТОГДА CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленАкт
		|						ИЛИ CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленСФ
		|			ИНАЧЕ CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленСчет
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Рез.ДоходыВсего) КАК ДоходыВсего,
		|	СУММА(Рез.ДоходыСумма) КАК ДоходыСумма,
		|	СУММА(Рез.РасходыВсего) КАК РасходыВсего,
		|	СУММА(Рез.РасходыСумма) КАК РасходыСумма,
		|	СУММА(Рез.ДоходыВсего - Рез.РасходыВсего) КАК ПрибыльВсего,
		|	СУММА(Рез.ДоходыСумма - Рез.РасходыСумма) КАК ПрибыльСумма,
		|	СУММА(Рез.ДоходыВсегоВалюта - Рез.РасходыВсегоВалюта) КАК ПрибыльВсегоВалюта,
		|	СУММА(Рез.ДоходыВсегоВалюта) КАК ДоходыВсегоВалюта,
		|	СУММА(Рез.РасходыВсегоВалюта) КАК РасходыВсегоВалюта,
		|	Рез.Контрагент,
		|	Рез.Номенклатура
		|ИЗ
		|	Рез КАК Рез
		|
		|СГРУППИРОВАТЬ ПО
		|	Рез.Контрагент,
		|	Рез.Номенклатура";
	Запрос.УстановитьПараметр("СпГП", ГП);
	Если (ОтображениеФинРеза <> Неопределено) Тогда
		Запрос.УстановитьПараметр("ФормированиеОтчета", ОтображениеФинРеза); 
	Иначе
		Запрос.УстановитьПараметр("ФормированиеОтчета", _БЭ.ПолучитьНастройкуПользователя( , "ОтображениеФинРез")); 	
	КонецЕсли; 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ИсключатьВнутрихолдинговые = CW_Настройки.ПолучитьНастройкуПользователя(,"ИсключатьВнутрихолдинговыеВзаиморасчеты");
	Если (ИсключатьВнутрихолдинговые) Тогда
		
		МассивХолдинговыхКонтрагентов = CW_Финансы.ПолучитьКонтрагентовХолдинга();
		Если (МассивХолдинговыхКонтрагентов.Количество() <> 0) Тогда
			МассивУдаляемых = Новый Массив;
			Для каждого Стр Из ТЗ Цикл
				
				Если (МассивХолдинговыхКонтрагентов.Найти(Стр.Контрагент) <> Неопределено) Тогда
					МассивУдаляемых.Добавить(Стр);
				КонецЕсли; 
				
			КонецЦикла; 
			_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МассивУдаляемых);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (ЗначениеЗаполнено(Номенклатура)) Тогда
		
		ТЗ = ТЗ.Скопировать(Новый Структура("Номенклатура"));
		
	КонецЕсли; 
	
	ТЗ.Свернуть(,"ДоходыВсего,ДоходыСумма,РасходыВсего,РасходыСумма,ПрибыльВсего,ПрибыльСумма,ПрибыльВсегоВалюта,ДоходыВсегоВалюта,РасходыВсегоВалюта");
	
	Возврат ТЗ;
	
КонецФункции	

Функция ФинансыОбновитьИтоги()
	
	ФорматВывода = "ЧЦ=15; ЧДЦ=2; ЧН=";

	ФинРез = _БЭ.ПолучитьФинРез(Грузоперевозки);

	СчетаАкты = "";
	Если ФормированиеОтчета = 1 Тогда
		СчетаАкты = " (по актам)";
	Иначе
		СчетаАкты = " (по счетам)";
	КонецЕсли;

	ВыводитьРезультатВБазовойВалюте = Истина;
	ВыводитьРасходыВБазовойВалюте 	= Истина;
	ВыводитьДоходыВБазовойВалюте 	= Истина;
	
	Если ВыводитьРезультатВВалютеДокументов Тогда

		ОбщаяВалюта = Справочники.Валюты.ПустаяСсылка();
		
		ВалютыРасходов = ФинансыРасходы.Выгрузить(, "Валюта");
		ВалютыРасходов.Свернуть("Валюта");
		
		ВалютыДоходов = ФинансыДоходы.Выгрузить(, "Валюта");
		ВалютыДоходов.Свернуть("Валюта");

		Если ВалютыРасходов.Количество() = 1 Тогда
			ВалютаРасходов = ВалютыРасходов[0].Валюта;
			ВыводитьРасходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаРасходов = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли;

		Если ВалютыДоходов.Количество() = 1 Тогда
			ВалютаДоходов = ВалютыДоходов[0].Валюта;
			ВыводитьДоходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаДоходов = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли;

		Если ВалютаРасходов = ВалютаДоходов И Не ВалютаРасходов.Пустая() Тогда
			ВыводитьРезультатВБазовойВалюте = Ложь;
			ОбщаяВалюта = ВалютаРасходов;
		ИначеЕсли ВалютаРасходов.Пустая() И Не ВалютаДоходов.Пустая() И ВалютыРасходов.Количество() = 0 Тогда
			ВыводитьРезультатВБазовойВалюте = Ложь;
			ОбщаяВалюта = ВалютаДоходов;
		ИначеЕсли Не ВалютаРасходов.Пустая() И ВалютаДоходов.Пустая() И ВалютыДоходов.Количество() = 0 Тогда
			ВыводитьРезультатВБазовойВалюте = Ложь;
			ОбщаяВалюта = ВалютаРасходов;
		КонецЕсли;

	КонецЕсли;

	Если ВыводитьРасходыВБазовойВалюте Тогда


		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Расходы" + СчетаАкты + ": " + Формат(ФинРез.Итог("РасходыВсего"), ФорматВывода) + " " + Строка(ВРУ));
		_сф.стр_Добавить(ТекстИтога, ", " + "расходы без НДС: " + Формат(ФинРез.Итог("РасходыСумма"), ФорматВывода) + " " + Строка(ВРУ));
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(ТекстИтога,"; Номенклатура="+Строка(Номенклатура));
		КонецЕсли; 
		
	Иначе


		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Расходы" + СчетаАкты + ": " + Формат(ФинРез.Итог("РасходыВсегоВалюта"), ФорматВывода) + " " + Строка(ВалютаРасходов));
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(ТекстИтога,"; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;

	КонецЕсли;
	
	Элементы.РасходыИтого.Заголовок = ТекстИтога;

	Если ВыводитьДоходыВБазовойВалюте Тогда

		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Доходы" + СчетаАкты + ": " + Формат(ФинРез.Итог("ДоходыВсего"), ФорматВывода) + " " + Строка(ВРУ));
		_сф.стр_Добавить(ТекстИтога, ", " + "доходы без НДС: " + Формат(ФинРез.Итог("ДоходыСумма"), ФорматВывода) + " " + Строка(ВРУ));
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(ТекстИтога,"; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;
		
	Иначе

		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Доходы" + СчетаАкты + ": " + Формат(ФинРез.Итог("ДоходыВсегоВалюта"), ФорматВывода) + " " + Строка(ВалютаДоходов));
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(ТекстИтога,"; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;

	КонецЕсли;
	
	Элементы.ДоходыИтого.Заголовок = ТекстИтога;

	Если ВыводитьРезультатВБазовойВалюте Тогда

		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Прибыль" + СчетаАкты + ": " + Формат(ФинРез.Итог("ПрибыльВсего"), ФорматВывода) + " " + Строка(ВРУ));
		_сф.стр_Добавить(ТекстИтога, ", " + "прибыль без НДС: " + Формат(ФинРез.Итог("ПрибыльСумма"), ФорматВывода) + " " + Строка(ВРУ));
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(ТекстИтога,"; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;
		
	Иначе


		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Прибыль" + СчетаАкты + ": " + Формат(ФинРез.Итог("ПрибыльВсегоВалюта"), ФорматВывода) + " " + Строка(ОбщаяВалюта));
		Если (ЗначениеЗаполнено(Номенклатура)) Тогда
			_сф.стр_Добавить(ТекстИтога,"; Номенклатура="+Строка(Номенклатура));
		КонецЕсли;

	КонецЕсли;
	
	Элементы.ФинансовыйРезультатИтого.Заголовок = ТекстИтога;

КонецФункции

&НаСервере
Процедура ОбновитьТаблицы(ИмяТаблицы = Неопределено)
	
	ОбновитьТаблицыФинансов(ИмяТаблицы);
	ТаблицыБюджетаОбновить(ИмяТаблицы);
	
КонецПроцедуры	

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьТаблицы();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяТекущейТаблицы()
	
	ИмяТаблицы  = Неопределено;
	
	Попытка
		ИмяСтраницы = Элементы.ГруппаСтраницыБюджета.ТекущаяСтраница.ПодчиненныеЭлементы[0].ТекущаяСтраница.Имя;
		ИмяТаблицы 	= СтрЗаменить(ИмяСтраницы,"Группа","");
	Исключение
	КонецПопытки;
	
	Возврат ИмяТаблицы;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьТаблицу(Команда)
	
	ИмяТаблицы = ПолучитьИмяТекущейТаблицы();
	
	ОбновитьТаблицы(ИмяТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуБюджета(ВыбраннаяСтрока)
	
	Возврат;
	
	ИмяТаблицы 		= ПолучитьИмяТекущейТаблицы();
	ВерсияБюджета 	= ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.ПустаяСсылка");
	ВидСтатьи		= ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.ПустаяСсылка");
	
	Если Найти(ИмяТаблицы,"План") > 0 Тогда
		
		ВерсияБюджета = ВерсияБюджетаПлан;
		
	ИначеЕсли Найти(ИмяТаблицы,"Факт") = 0 Тогда	
		
		ВерсияБюджета = ВерсияБюджетаФакт;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если Найти(ИмяТаблицы,"Доход") > 0 Тогда
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы");
		
	ИначеЕсли Найти(ИмяТаблицы,"Расход") > 0 Тогда	
		
		ВидСтатьи = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");
		
	КонецЕсли;	
	
	СтрокаТаблицы = Элементы["Бюджет" + ИмяТаблицы].ТекущиеДанные;
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("ЗаказСсылка",           	Заказ);
	ДанныеЗаполнения.Вставить("ВерсияБюджета",         	ВерсияБюджета);
	ДанныеЗаполнения.Вставить("ВидСтатьиПланирования", 	ВидСтатьи);
	ДанныеЗаполнения.Вставить("Контрагент",            	СтрокаТаблицы.Контрагент);
	ДанныеЗаполнения.Вставить("Номенклатура",          	СтрокаТаблицы.Номенклатура);
	ДанныеЗаполнения.Вставить("Валюта",                	СтрокаТаблицы.Валюта);
	ДанныеЗаполнения.Вставить("СтавкаНДС",             	СтрокаТаблицы.СтавкаНДС);
	ДанныеЗаполнения.Вставить("Организация",			СтрокаТаблицы.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеЗаполнения",			ДанныеЗаполнения);
	ПараметрыФормы.Вставить("ТолькоПросмотр", 			Истина);
	
	Описание = Новый ОписаниеОповещения("ПослеЗакрытияПодчиненнойФормы",ЭтотОбъект,Новый Структура("ИмяТаблицы",ИмяТаблицы));
	
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаРедактированияГруппыСтатей", ПараметрыФормы, ЭтаФорма,,,,Описание);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияПодчиненнойФормы(Результат,СтруктураПараметров) Экспорт
	
	ИмяТаблицы = Неопределено;
	СтруктураПараметров.Свойство("ИмяТаблицы",ИмяТаблицы);
	
	ОбновитьТаблицы(ИмяТаблицы);
	
КонецПроцедуры	

&НаКлиенте
Процедура БюджетДоходыПланВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ОткрытьФормуБюджета(ВыбраннаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыПланПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФормуБюджета(Элемент.ТекущийЭлемент);

КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиПослеУдаления(Элемент)
	ОбновитьТаблицы();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрузоперевозкиПоЗаказу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Заказ = &Заказ
	               |	И CW_Грузоперевозки.Заказ <> ЗНАЧЕНИЕ(Справочник.CW_Заказы.ПустаяСсылка)";
				   
	Запрос.УстановитьПараметр("Заказ", Заказ);			   
	
	Грузоперевозки.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	ОбновитьТаблицы();
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриВыбореЗаказа(Ответ,Параметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		
		Заказ = ЗаказДоИзм;
		Возврат;
		
	КонецЕсли;	
	
	ЗаказДоИзм = Заказ;
	ЗаполнитьГрузоперевозкиПоЗаказу();
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	Если Не Грузоперевозки.Количество() Тогда
		
		ЗаказДоИзм = Заказ;
		ЗаполнитьГрузоперевозкиПоЗаказу();
		
		Возврат;
	КонецЕсли;	
	
	Если Заказ <> ЗаказДоИзм И ЗначениеЗаполнено(ЗаказДоИзм) Тогда
		
		Описание = Новый ОписаниеОповещения("ПриВыбореЗаказа", ЭтотОбъект, Новый Структура("Заказ",Заказ));
		
		ПоказатьВопрос(Описание, "Список грузоперевозок будет " +?(ЗначениеЗаполнено(Заказ),"очищен", "перезаполнен") + ", продолжить?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДокумента()
	
	ИмяТаблицы		= ПолучитьИмяТекущейТаблицы();
	СтрокаТаблицы 	= Элементы[ИмяТаблицы].ТекущиеДанные;
	 
	 Если СтрокаТаблицы = Неопределено Тогда
		 Возврат;
	 КонецЕсли;
	 
	 Документ = СтрокаТаблицы.Документ;
		
	Если ИмяТаблицы = "ФинансыРасходы" Тогда
		
		ИмяФормыДокумента = "Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта";
		
	ИначеЕсли ИмяТаблицы = "ФинансыДоходы" Тогда 
		
		ИмяФормыДокумента = "Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта";
		
	КонецЕсли; 
	
	Попытка
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Документ);
		ОткрытьФорму(ИмяФормыДокумента, ПараметрыФормы,ЭтаФорма);
	Исключение
	КонецПопытки; 
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ФинансыДоходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансыДоходыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФормуДокумента();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаАктированиеВходящих(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заказ",Заказ); 
	ОткрытьФорму("Отчет.CW_НеАктированыеВходящиеСчета.Форма.ФормаОтчета",ПараметрыФормы);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаАктированиеИсходящих(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заказ",Заказ); 
	ОткрытьФорму("Отчет.CW_НеАктированыеИсходящиеСчета.Форма.ФормаОтчета",ПараметрыФормы);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаВыполнитьЗакрытие(Команда)
	
	Если (НЕ ЗначениеЗаполнено(Заказ)) Тогда
		Возврат;
	КонецЕсли; 
	
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаЗакрытияЗаказа",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("Отчет.CW_АнализГрузоперевозокПоБюджетам.Форма.ФормаЗакрытияЗаказа",,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияЗаказа(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ.фл1 ИЛИ Ответ.фл2 ИЛИ Ответ.фл3) Тогда
			
			РезультатЗакрытия = _ВыполнитьЗакрытие(Ответ);
			Если (_УФКС.ВыполненоУспешно(РезультатЗакрытия)) Тогда
				Состояние("Закрытие выполнено.");
			Иначе
				_УФК.ВывестиПредупреждение("Ошибка закрытия заказа.");
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ВыполнитьЗакрытие(Параметры)
	// --- 
	
	Попытка
		
		Если (Параметры.фл3) Тогда
			CW_Мониторинг.УстановитьДатуЗакрытия(Заказ,Параметры.Дата);  
		КонецЕсли;
		
		Для каждого СтрГП Из Грузоперевозки Цикл
			
			ГП = СтрГП.Значение.ПолучитьОбъект();
			// --- 
			Если (Параметры.фл1) Тогда
				СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ГП,ПараметрЗакрытия); 
				Если (СтрокаПараметра = Неопределено) Тогда
					СтрокаПараметра = ГП.ПараметрыГрузоперевозки.Добавить();
					СтрокаПараметра.Параметр = ПараметрЗакрытия;
				КонецЕсли; 
				СтрокаПараметра.ЗначениеФакт = Параметры.Дата;
				СтрокаПараметра.Значение = Параметры.Дата;
			КонецЕсли;
			Если (Параметры.фл1) Тогда
				СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ГП,ПараметрКонтроля); 
				Если (СтрокаПараметра = Неопределено) Тогда
					СтрокаПараметра = ГП.ПараметрыГрузоперевозки.Добавить();
					СтрокаПараметра.Параметр = ПараметрКонтроля;
				КонецЕсли; 
				СтрокаПараметра.ЗначениеФакт = Параметры.Дата;
				СтрокаПараметра.Значение = Параметры.Дата;
			КонецЕсли;
			// --- 
			ГП.Записать(); 
			
		КонецЦикла; 
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат(_УФКС.Ответ(1));
	КонецПопытки; 
	
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
